src/DataProcessors/кфкЗаполнениеИменПолейСпецификации/кфкЗаполнениеИменПолейСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>кфкЗаполнениеИменПолейСпецификации</name>
</mdclass:DataProcessor>

src/InformationRegisters/кфкШаблоныИменПолейСпецификации/кфкШаблоныИменПолейСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкШаблоныИменПолейСпецификации</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b00d3374-fba3-4dfd-a8b9-2e9192589501">
  <name>ТипыОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a8e9e82-d92a-4009-b106-ec0dad7bbfdc">
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="28f6293b-0a76-4f8d-b741-d6a86e461c95">
    <name>Булево</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c96f080e-8e03-46df-92cf-899101180ccb">
    <name>Строка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52776854-ef3f-4d53-9b46-b1f5921f3db5">
    <name>Число</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="85dae71e-5343-4aa2-ad48-5bafd0e77bf1">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ef44e26-9f8a-4f9f-af9f-b045c498816a">
    <name>ХранилищеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="edc93a94-df17-4565-a085-b9635011d6e4">
    <name>УникальныйИдентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3cc366d1-dec6-4c40-bc75-a26c1cc4d307">
    <name>Перечисление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e59131cc-796f-4a59-b508-b7116216ed5f">
    <name>ЛюбаяСсылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="61c264b5-4a1a-4a85-9134-71d05b5ef74f">
    <name>Справочник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f39eb3b4-764d-4e49-9149-79a08def2a0e">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3b69793-028f-4701-963c-d2e5302d5e7b">
    <name>ПланВидовРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3817b5d5-5de7-4f12-85c4-5037b01e683d">
    <name>ПланВидовХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ff655-d737-4f7e-99a8-70bdd157c150">
    <name>ПланОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="556282ca-df4a-4d71-b417-48193ff98076">
    <name>ПланСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="666398bf-eff8-4172-9c11-f7e1a1382499">
    <name>ТочкаМаршрутаБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4ec2030-fa42-4716-a9e9-87a282796ebb">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bf7d940d-ea2d-4e76-9a9b-17544835afee">
    <name>ВидРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b65ce0b2-9d46-44a6-8beb-4b6114c07627">
    <name>ВидСубконто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Объекты/Объекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ac03d05d-31ff-4be8-8134-befc15ed8a20">
  <name>Объекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f6c31941-e0ce-4411-9dc8-1dca828a5160">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="35277a40-8eae-4ba3-886e-04e15c93bfdc">
    <name>Имя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Свойства/Свойства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3707464-2a14-4985-bd92-b2906fe80703">
  <name>Свойства</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="88e0934d-f5b7-4d3b-a324-4f6c5b80407c">
    <name>ТипыСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e441ff9-cd6f-45c0-a5a8-d6cefa01a348">
    <name>Синоним</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7f9fa1f0-0199-4658-9c43-8575de12ad99">
    <name>КвалификаторыСтроки_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="89d50220-35f5-4f73-8942-4760660dba77">
    <name>КвалификаторыЧисла_Точность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea9570d1-cf27-4e71-b8a2-f1e06ae94a82">
    <name>КвалификаторыЧисла_Неотрицательное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b991c56-77fb-49ae-8497-7fb5d6407663">
    <name>КвалификаторыДаты_Состав</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf3a7a6b-fc30-420a-81e1-04256ffec92a">
    <name>КвалификаторыЧисла_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4241a1f-7376-4978-a1eb-f250ed66f49d">
    <name>КвалификаторыСтроки_Фиксированная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7727b533-9762-4bdd-ae6f-c7bd22ad8be8">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>кфкПроверкаЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f50349b9-19fc-4f4a-8966-8a1aa8fc445c">
    <name>Типы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3a1b3e7-3fea-4264-8c13-a0b13219e4b6">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/кфкЗаполнениеИменПолейСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает JSON с описаниями объектов, свойств и табличных частей выбранного релиза.
// Параметры:
//  Релиз - СправочникСсылка.Релизы
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - дерево метаданных с UUID в качестве ключей.
Функция ОписаниеМетаданных(Релиз) Экспорт

	РезультатЗапроса = ДанныеМетаданных(Релиз);

	Объекты = РезультатЗапроса[0].Выгрузить();
	Свойства = РезультатЗапроса[1].Выгрузить();
	ТабличныеЧасти = РезультатЗапроса[2].Выгрузить();

	Свойства.Индексы.Добавить("Владелец,Родитель");
	ТабличныеЧасти.Индексы.Добавить("Владелец");

	Возврат ОписанияОбъектов(Объекты, Свойства, ТабличныеЧасти);

КонецФункции

// Заполняет английские имена объектов, свойств и полей табличных частей по UUID.
// Проверяет русские имена и принадлежность свойств перед записью каждого элемента.
// Пустые английские имена не изменяют сохраненные значения.
//
// Параметры:
//  Описание - см. ОписаниеМетаданных
Процедура ЗагрузитьИменаСпецификации(Описание) Экспорт

	Для Каждого КлючЗначениеОбъекта Из Описание Цикл

		СсылкаОбъекта = Справочники.Объекты.ПолучитьСсылку(
			Новый УникальныйИдентификатор(КлючЗначениеОбъекта.Ключ));
		Объект = СсылкаОбъекта.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Объект %1 не найден.'"), КлючЗначениеОбъекта.Ключ);
		КонецЕсли;
		
		ОписаниеОбъекта = КлючЗначениеОбъекта.Значение; // Структура, Соответствие
		Если Объект.Имя <> ОписаниеОбъекта["ИмяRU"] Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Имя объекта %1 не совпадает с загруженным.'"), КлючЗначениеОбъекта.Ключ);
		КонецЕсли;
		
		ЗаполнитьИмяEN(Объект, ОписаниеОбъекта["ИмяEN"]);
		ЗагрузитьИменаСвойств(Объект.Ссылка, Справочники.Свойства.ПустаяСсылка(), ОписаниеОбъекта["Свойства"]);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Загружает имена свойств объекта и вложенных полей табличных частей.
// Вложенные поля передаются в необязательном ключе Свойства описания элемента.
//
// Параметры:
//  Владелец - СправочникСсылка.Объекты
//  Родитель - СправочникСсылка.Свойства - пустая ссылка для свойств объекта.
//  Описание - см. ОписанияСвойств
Процедура ЗагрузитьИменаСвойств(Знач Владелец, Знач Родитель, Знач Описание)

	Для Каждого КлючЗначениеСвойства Из Описание Цикл

		СсылкаСвойства = Справочники.Свойства.ПолучитьСсылку(
			Новый УникальныйИдентификатор(КлючЗначениеСвойства.Ключ));
		Свойство = СсылкаСвойства.ПолучитьОбъект();
		Если Свойство = Неопределено Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Свойство %1 не найдено.'"), КлючЗначениеСвойства.Ключ);
		КонецЕсли;
		Если Свойство.Владелец <> Владелец Или Свойство.Родитель <> Родитель Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Свойство %1 не принадлежит указанному объекту или группе свойств.'"),
				КлючЗначениеСвойства.Ключ);
		КонецЕсли;
		
		ОписаниеСвойства = КлючЗначениеСвойства.Значение; // Структура, Соответствие
		Если Свойство.Наименование <> ОписаниеСвойства["ИмяRU"] Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Имя свойства %1 не совпадает с загруженным.'"), КлючЗначениеСвойства.Ключ);
		КонецЕсли;

		ЗаполнитьИмяEN(Свойство, ОписаниеСвойства["ИмяEN"]);

		ВложенныеСвойства = Неопределено; // Соответствие
		Если ТипЗнч(ОписаниеСвойства) = Тип("Соответствие") Тогда
			ВложенныеСвойства = ОписаниеСвойства.Получить("Свойства");
		Иначе
			ОписаниеСвойства.Свойство("Свойства", ВложенныеСвойства);
		КонецЕсли;
		Если ВложенныеСвойства <> Неопределено Тогда
			ЗагрузитьИменаСвойств(Владелец, Свойство.Ссылка, ВложенныеСвойства);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Записывает измененное непустое английское имя элемента.
//
// Параметры:
//  Элемент - СправочникОбъект.Объекты, СправочникОбъект.Свойства
//  ИмяEN - Строка
Процедура ЗаполнитьИмяEN(Элемент, Знач ИмяEN)
	
	Если ПустаяСтрока(ИмяEN) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Пустое английское имя свойства %1.'"), Элемент.Наименование);
	ИначеЕсли Элемент.кфкИмяEN <> ИмяEN Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Изменено английское имя свойства %1.'"), Элемент.Наименование);
	ИначеЕсли Элемент.кфкИмяEN = ИмяEN Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.кфкИмяEN = ИмяEN;
	Элемент.Записать();

КонецПроцедуры

// Возвращает результаты пакетного запроса по объектам, свойствам и табличным частям релиза.
// Параметры:
//  Релиз - СправочникСсылка.Релизы
// Возвращаемое значение:
//  Массив из РезультатЗапроса - объекты, свойства и табличные части в исходном порядке.
Функция ДанныеМетаданных(Знач Релиз)

	// Получаем объекты, свойства и табличные части одним пакетом запросов.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка,
		|	Т.Имя КАК ИмяRU,
		|	Т.кфкИмяEN КАК ИмяEN,
		|	Т.Тип КАК Тип
		|ИЗ
		|	Справочник.Объекты КАК Т
		|ГДЕ
		|	Т.Владелец = &Владелец
		|	И Т.Тип В (&СсылочныеТипыОбъектов)
		|	И Т.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Свойства.Ссылка КАК Ссылка,
		|	Свойства.Владелец КАК Владелец,
		|	Свойства.Родитель КАК Родитель,
		|	Свойства.Наименование КАК ИмяRU,
		|	ВЫБОР
		|		КОГДА Свойства.Наименование = """"""""
		|			ТОГДА ЕСТЬNULL(ШаблоныИмен.Значение, """")
		|		ИНАЧЕ Свойства.Наименование
		|	КОНЕЦ КАК ИмяEN,
		|	ВЫБОР
		|		КОГДА ТОбъекты.Тип В (&СсылочныеТипыОбъектов)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.УникальныйИдентификатор)
		|		ИНАЧЕ ТОбъекты.Тип
		|	КОНЕЦ КАК Тип
		|ИЗ
		|	Справочник.Свойства КАК Свойства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Объекты
		|		ПО Свойства.Владелец = Объекты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
		|		ПО Свойства.Ссылка = СвойстваТипы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ТОбъекты
		|		ПО СвойстваТипы.Тип = ТОбъекты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.кфкШаблоныИменПолейСпецификации КАК ШаблоныИмен
		|		ПО Свойства.Наименование = ШаблоныИмен.Ключ
		|ГДЕ
		|	Объекты.Владелец = &Владелец
		|	И Свойства.ЭтоГруппа = ЛОЖЬ
		|	И Свойства.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Свойства.Ссылка КАК Ссылка,
		|	Свойства.Владелец КАК Владелец,
		|	Свойства.Наименование КАК ИмяRU,
		|	ВЫБОР
		|		КОГДА Свойства.Наименование = """"""""
		|			ТОГДА ЕСТЬNULL(ШаблоныИмен.Значение, """")
		|		ИНАЧЕ Свойства.Наименование
		|	КОНЕЦ КАК ИмяEN
		|ИЗ
		|	Справочник.Свойства КАК Свойства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Объекты
		|		ПО Свойства.Владелец = Объекты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.кфкШаблоныИменПолейСпецификации КАК ШаблоныИмен
		|		ПО Свойства.Наименование = ШаблоныИмен.Ключ
		|ГДЕ
		|	Объекты.Владелец = &Владелец
		|	И Свойства.ЭтоГруппа = ИСТИНА
		|	И Свойства.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", Релиз);
	Запрос.УстановитьПараметр("СсылочныеТипыОбъектов", Перечисления.ТипыОбъектов.кфкСсылочныеТипы());
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Возврат РезультатЗапроса;

КонецФункции

// Возвращает дерево описаний объектов, их свойств и табличных частей.
// Параметры:
//  Объекты - ТаблицаЗначений:
//   * Ссылка - СправочникСсылка.Объекты
//   * ИмяRU - Строка
//   * ИмяEN - Строка
//   * Тип - ПеречислениеСсылка.ТипыОбъектов
//  Свойства - ТаблицаЗначений:
//   * Ссылка - СправочникСсылка.Свойства
//   * Владелец - СправочникСсылка.Объекты
//   * Родитель - СправочникСсылка.Свойства
//   * ИмяRU - Строка
//   * ИмяEN - Строка
//   * Тип - ПеречислениеСсылка.ТипыОбъектов
//  ТабличныеЧасти - ТаблицаЗначений:
//   * Ссылка - СправочникСсылка.Свойства
//   * Владелец - СправочникСсылка.Объекты
//   * ИмяRU - Строка
//   * ИмяEN - Строка
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - UUID объекта.
//   * Значение - Структура:
//    ** ИмяRU - Строка
//    ** ИмяEN - Строка
//    ** Тип - Строка
//    ** Свойства - Соответствие из КлючИЗначение:
//     *** Ключ - Строка - UUID свойства или табличной части.
//     *** Значение - Структура:
//      **** ИмяRU - Строка
//      **** ИмяEN - Строка
//      **** Тип - Строка - присутствует у свойства.
//      **** Свойства - Соответствие из КлючИЗначение - присутствует у табличной части:
//       ***** Ключ - Строка - UUID свойства табличной части.
//       ***** Значение - Структура:
//        ****** ИмяRU - Строка
//        ****** ИмяEN - Строка
//        ****** Тип - Строка
Функция ОписанияОбъектов(Знач Объекты, Знач Свойства, Знач ТабличныеЧасти)

	Результат = Новый Соответствие;
	Для Каждого Объект Из Объекты Цикл
		
		СвойстваОбъекта = ОписанияСвойств(Объект.Ссылка, Справочники.Свойства.ПустаяСсылка(), Свойства);

		ОтборТабличныхЧастей = Новый Структура("Владелец", Объект.Ссылка);
		Для Каждого ТЧ Из ТабличныеЧасти.НайтиСтроки(ОтборТабличныхЧастей) Цикл
			
			СвойстваТЧ = ОписанияСвойств(Объект.Ссылка, ТЧ.Ссылка, Свойства);
			
			Если СвойстваТЧ.Количество() = 0 И Не ПустаяСтрока(ТЧ.ИмяEN) Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеТЧ = Новый Структура;
			ОписаниеТЧ.Вставить("ИмяRU", ТЧ.ИмяRU);
			ОписаниеТЧ.Вставить("ИмяEN", ТЧ.ИмяEN);
			ОписаниеТЧ.Вставить("Тип", "ТабличнаяЧасть");
			ОписаниеТЧ.Вставить("Свойства", СвойстваТЧ);
			СвойстваОбъекта.Вставить(XMLСтрока(ТЧ.Ссылка), ОписаниеТЧ);
			
		КонецЦикла;
		
		Если СвойстваОбъекта.Количество() = 0 И Не ПустаяСтрока(Объект.ИмяEN) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеОбъекта = Новый Структура;
		ОписаниеОбъекта.Вставить("ИмяRU", Объект.ИмяRU);
		ОписаниеОбъекта.Вставить("ИмяEN", Объект.ИмяEN);
		ОписаниеОбъекта.Вставить("Тип", XMLСтрока(Объект.Тип));
		ОписаниеОбъекта.Вставить("Свойства", СвойстваОбъекта);
		Результат.Вставить(XMLСтрока(Объект.Ссылка), ОписаниеОбъекта);
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает описания свойств объекта или табличной части, сгруппированные по UUID.
// Параметры:
//  Владелец - СправочникСсылка.Объекты
//  Родитель - СправочникСсылка.Свойства
//  Свойства - ТаблицаЗначений:
//   * Ссылка - СправочникСсылка.Свойства
//   * Владелец - СправочникСсылка.Объекты
//   * Родитель - СправочникСсылка.Свойства
//   * ИмяRU - Строка
//   * ИмяEN - Строка
//   * Тип - ПеречислениеСсылка.ТипыОбъектов
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - UUID свойства.
//   * Значение - Структура:
//    ** ИмяRU - Строка
//    ** ИмяEN - Строка
//    ** Тип - Строка
Функция ОписанияСвойств(Знач Владелец, Знач Родитель, Знач Свойства)

	Результат = Новый Соответствие;
	Отбор = Новый Структура("Владелец, Родитель", Владелец, Родитель);

	Для Каждого Свойство Из Свойства.НайтиСтроки(Отбор) Цикл
		
		Если Не ПустаяСтрока(Свойство.ИмяEN) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеСвойства = Новый Структура;
		ОписаниеСвойства.Вставить("ИмяRU", Свойство.ИмяRU);
		ОписаниеСвойства.Вставить("ИмяEN", Свойство.ИмяEN);
		ОписаниеСвойства.Вставить("Тип", XMLСтрока(Свойство.Тип));
		Результат.Вставить(XMLСтрока(Свойство.Ссылка), ОписаниеСвойства);
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
